/*
*********************************************************************************************************
*
*	模块名称 : 看门狗驱动模块
*	文件名称 : bsp_wdg.c
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号      日期        作者     说明
*		 V1.0    2017-02-21 	 ymh  	正式发布
*
*	Copyright (C), 2015-2016,  YMH
*
*********************************************************************************************************
*/
#include "bsp.h"

/*
*********************************************************************************************************
*	函 数 名: bsp_IWDGInit
*	功能说明: 看门狗初始化 - Tout = 40 / Prescaler * Reload； //单位为毫秒
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_iwdg_init(void)
{
	//使能对寄存器IWDG_PR和IWDG_RLR的写操作	
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);
	
	//设置IWDG预分频值:6.4ms
	IWDG_SetPrescaler(IWDG_Prescaler_256);
	
	//设置IWDG重装载值:6.4 * 2000 / 1000 = 5s	
	IWDG_SetReload(2344);
	
	//按照IWDG重装载寄存器的值重装载IWDG计数器
	IWDG_ReloadCounter();  							
		
	//使能IWDG
	IWDG_Enable();
}

/*
*********************************************************************************************************
*	函 数 名: bsp_IWDGClr
*	功能说明: 喂狗
*	形    参: 无
*	返 回 值: 无
*********************************************************************************************************
*/
void bsp_iwdg_clear(void)
{
	IWDG_ReloadCounter();
}

/***************************** YMH (END OF FILE) *********************************/
