/*
*********************************************************************************************************
*
*	模块名称 : 看门狗驱动模块头文件
*	文件名称 : bsp_wdg.h
*	版    本 : V1.0
*	说    明 : 
*
*	修改记录 :
*		版本号      日期        作者     说明
*		 V1.0    2017-02-21 	 ymh  	正式发布
*
*	Copyright (C), 2015-2016,  YMH
*
*********************************************************************************************************
*/

#ifndef _BSP_IWDG_H
#define _BSP_IWDG_H


extern void bsp_iwdg_init(void);
extern void bsp_iwdg_clear(void);

#endif 

/***************************** YMH (END OF FILE) *********************************/

